# NumberOfFacets Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshTopology..::..NumberOfFacets Property
PolymeshTopology Class See Also
---
The number of facet in the polymesh.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int NumberOfFacets { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfFacets As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfFacets {
	int get ();
}
```

# See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace